In [1]:
import pandas as pd

In [3]:
d=pd.Series([4,8,15,16,23,43])
d

0     4
1     8
2    15
3    16
4    23
5    43
dtype: int64

In [7]:
type(d)

pandas.core.series.Series

In [9]:
my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
series=pd.Series(my_list)
series

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [11]:
type(series)

pandas.core.series.Series

In [37]:
p=pd.DataFrame(pd.Series(['alice','bob','claire']))
p[1]=25,30,27
p[2]='female','male','female'
p.columns=['Name','Age','Gender']
p

     Name  Age  Gender
0   alice   25  female
1     bob   30    male
2  claire   27  female

In [39]:
'''4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.'''
#data frame is a two-dimensional data structure with columns that can hold different data types 
#series is one dimensional array-like object containing a sequence of values and index
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 22],
        'Grade': [90, 85, 95]}
df = pd.DataFrame(data)
print(df)

      Name  Age  Grade
0    Alice   25     90
1      Bob   30     85
2  Charlie   22     95

In [41]:
age_series = df['Age']
print(age_series)

0    25
1    30
2    22
Name: Age, dtype: int64

In [45]:
type(df)

pandas.core.frame.DataFrame

In [47]:
type(age_series)

pandas.core.series.Series

In [61]:
'''5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?'''
#the common functions to manipulate pandas dataframe
#loc
#iloc
#dropna()
#fillna()
#reolace()
#describe()
# to manipulate the data loc and iloc are the main

p

     Name  Age  Gender
0   alice   25  female
1     bob   30    male
2  claire   27  female

In [55]:
p.loc[0:2,['Name','Age']]

     Name  Age
0   alice   25
1     bob   30
2  claire   27

In [59]:
p.iloc[1:4,2]

1      male
2    female
Name: Gender, dtype: object

In [ ]:
'''6. Which of the following is mutable in nature Series, DataFrame, Panel'''
#both data frame and series are mutable
#panel is 3D data structure due to its complexity the data frame is not mutable

In [63]:
'''7. Create a DataFrame using multiple Series. Explain with an example.'''
series1 = pd.Series([1, 2, 3], index=['a', 'b', 'c'])
series2 = pd.Series([4, 5, 6], index=['a', 'b', 'c'])
series3 = pd.Series([7, 8, 9], index=['a', 'b', 'c'])
df = pd.concat([series1, series2, series3], axis=1)
print(df)

   0  1  2
a  1  4  7
b  2  5  8
c  3  6  9